ruuvi/ruuvi.drivers.c/nrf5_sdk15_platform/communication/ruuvi_platform_communication_ble4_gatt.c
/**@brief Function for the GAP initialization.
 *
 * @details This function will set up all the necessary GAP (Generic Access Profile) parameters of
 *          the device. It also sets the permissions.
 */
static ret_code_t gap_params_init(void)
{
  ret_code_t              err_code;
  ble_gap_conn_params_t   gap_conn_params;
  ble_gap_conn_sec_mode_t sec_mode;

  BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

  memset(&gap_conn_params, 0, sizeof(gap_conn_params));

  gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
  gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
  gap_conn_params.slave_latency     = SLAVE_LATENCY;
  gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

  err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
  return err_code;
}

/**@brief Function for handling errors from the Connection Parameters module.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
  RUUVI_DRIVER_ERROR_CHECK(ruuvi_platform_to_ruuvi_error(&nrf_error), RUUVI_DRIVER_SUCCESS);
}

/**@brief Function for handling an event from the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module
 *          which are passed to the application.
 *
 * @note All this function does is to disconnect. This could have been done by simply setting
 *       the disconnect_on_fail config parameter, but instead we use the event handler
 *       mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
  uint32_t err_code;
  if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
  {
    err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
    RUUVI_DRIVER_ERROR_CHECK(ruuvi_platform_to_ruuvi_error(&err_code), RUUVI_DRIVER_SUCCESS);
  }
}


/**@brief Function for initializing the Connection Parameters module.
 */
static ret_code_t conn_params_init(void)
{
  uint32_t               err_code;
  ble_conn_params_init_t cp_init;

  memset(&cp_init, 0, sizeof(cp_init));

  cp_init.p_conn_params                  = NULL;
  cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
  cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
  cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
  cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
  cp_init.disconnect_on_fail             = false;
  cp_init.evt_handler                    = on_conn_params_evt;
  cp_init.error_handler                  = conn_params_error_handler;

  err_code = ble_conn_params_init(&cp_init);
  return err_code;
}


/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_evt       Nordic UART Service event.
 */
/**@snippet [Handling the data received over BLE] */
static void nus_data_handler(ble_nus_evt_t * p_evt)
{
  if(NULL == channel ||
     NULL == channel->on_evt)
  {
    return;
  }

  switch(p_evt->type)
  {
    case BLE_NUS_EVT_RX_DATA:
      channel->on_evt(RUUVI_INTERFACE_COMMUNICATION_RECEIVED, (void*)p_evt->params.rx_data.p_data, p_evt->params.rx_data.length);
      break;

    case BLE_NUS_EVT_COMM_STARTED:
      channel->on_evt(RUUVI_INTERFACE_COMMUNICATION_CONNECTED, NULL, 0);
      break;

    case BLE_NUS_EVT_COMM_STOPPED:
      channel->on_evt(RUUVI_INTERFACE_COMMUNICATION_DISCONNECTED, NULL, 0);
      break;

    case BLE_NUS_EVT_TX_RDY:
      channel->on_evt(RUUVI_INTERFACE_COMMUNICATION_SENT, NULL, 0);
      break;

    default:
      break;
  }
}

/**@brief Function for handling BLE events.
 *
 * TODO: Error handling
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 * @param[in]   p_context   Unused.
 *
 */
static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context)
{
  uint32_t err_code;

  switch (p_ble_evt->header.evt_id)
  {
  case BLE_GAP_EVT_CONNECTED:
    m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
    err_code = nrf_ble_qwr_conn_handle_assign(&m_qwr, m_conn_handle);
    ruuvi_platform_log(RUUVI_INTERFACE_LOG_DEBUG, "Connected \r\n");
    RUUVI_DRIVER_ERROR_CHECK(ruuvi_platform_to_ruuvi_error(&err_code), RUUVI_DRIVER_SUCCESS);
    break;

  case BLE_GAP_EVT_DISCONNECTED:
    ruuvi_platform_log(RUUVI_INTERFACE_LOG_DEBUG, "Disconnected \r\n");
    // ble_nus.c does not call NUS callback on disconnect, call it here.
    ble_nus_evt_t evt = { 0 };
    evt.type = BLE_NUS_EVT_COMM_STOPPED;
    nus_data_handler(&evt);
    m_conn_handle = BLE_CONN_HANDLE_INVALID;
    break;

  case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
  {
    ble_gap_phys_t const phys =
    {
      .rx_phys = BLE_GAP_PHY_AUTO,
      .tx_phys = BLE_GAP_PHY_AUTO,
    };
    err_code = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
    RUUVI_DRIVER_ERROR_CHECK(ruuvi_platform_to_ruuvi_error(&err_code), RUUVI_DRIVER_SUCCESS);
  } break;

  case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
    // Pairing not supported
    err_code = sd_ble_gap_sec_params_reply(m_conn_handle, BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP, NULL, NULL);
    RUUVI_DRIVER_ERROR_CHECK(ruuvi_platform_to_ruuvi_error(&err_code), RUUVI_DRIVER_SUCCESS);
    break;

  case BLE_GATTS_EVT_SYS_ATTR_MISSING:
    // No system attributes have been stored.
    err_code = sd_ble_gatts_sys_attr_set(m_conn_handle, NULL, 0, 0);
    RUUVI_DRIVER_ERROR_CHECK(ruuvi_platform_to_ruuvi_error(&err_code), RUUVI_DRIVER_SUCCESS);
    break;

  case BLE_GATTC_EVT_TIMEOUT:
    // Disconnect on GATT Client timeout event.
    err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
                                     BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
    RUUVI_DRIVER_ERROR_CHECK(ruuvi_platform_to_ruuvi_error(&err_code), RUUVI_DRIVER_SUCCESS);
    break;

  case BLE_GATTS_EVT_TIMEOUT:
    // Disconnect on GATT Server timeout event.
    err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
                                     BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
    RUUVI_DRIVER_ERROR_CHECK(ruuvi_platform_to_ruuvi_error(&err_code), RUUVI_DRIVER_SUCCESS);
    break;

