ruuvi/ruuvi.drivers.c/nrf5_sdk15_platform/communication/ruuvi_platform_communication_ble4_gatt.c
  ret_code_t err_code = NRF_SUCCESS;
  ruuvi_driver_status_t radio_status = RUUVI_DRIVER_SUCCESS;

  if (!m_gatt_is_init)
  {
    radio_status = ruuvi_interface_communication_radio_init(RUUVI_INTERFACE_COMMUNICATION_RADIO_GATT);
    if(RUUVI_DRIVER_SUCCESS != err_code) { return err_code; }
  }

  // Connection param module requires timers
  if(!ruuvi_platform_timers_is_init())
  {
    ruuvi_platform_log(RUUVI_INTERFACE_LOG_ERROR, "NRF5 SDK15 BLE4 GATT module requires initialized timers\r\n");
    return RUUVI_DRIVER_ERROR_INVALID_STATE;
  }
  nrf_ble_qwr_init_t qwr_init = {0};

  // Register a handler for BLE events.
  NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, NULL);

  err_code |= peer_manager_init();

  err_code |= gap_params_init();

  err_code |= nrf_ble_gatt_init(&m_gatt, gatt_evt_handler);

  err_code |= nrf_ble_gatt_att_mtu_periph_set(&m_gatt, NRF_SDH_BLE_GATT_MAX_MTU_SIZE);

  // Initialize Queued Write Module.
  qwr_init.error_handler = nrf_qwr_error_handler;

  err_code |= nrf_ble_qwr_init(&m_qwr, &qwr_init);

  err_code |= conn_params_init();

  if (NRF_SUCCESS == err_code)
  {
    m_gatt_is_init = true;
  }

  return ruuvi_platform_to_ruuvi_error(&err_code);
}

/**
 *
 */
static ruuvi_driver_status_t ruuvi_interface_communication_ble4_gatt_nus_uninit(ruuvi_interface_communication_t* const _channel)
{
  if(NULL == _channel) { return RUUVI_DRIVER_ERROR_NULL; }
  memset(_channel, 0, sizeof(ruuvi_interface_communication_t));
  m_gatt_is_init = false;
  // disconnect
  if(BLE_CONN_HANDLE_INVALID != m_conn_handle)
  {
    sd_ble_gap_disconnect(m_conn_handle, HCI_ERROR_CODE_CONN_TERM_BY_LOCAL_HOST);
  }
  // Services cannot be uninitialized
  ruuvi_interface_communication_radio_uninit(RUUVI_INTERFACE_COMMUNICATION_RADIO_GATT);
  return RUUVI_DRIVER_SUCCESS;
}

/**
 *
 */
static ruuvi_driver_status_t ruuvi_interface_communication_ble4_gatt_nus_send(ruuvi_interface_communication_message_t* const message)
{
  if(NULL == message) { return RUUVI_DRIVER_ERROR_NULL; }
  if(BLE_NUS_MAX_DATA_LEN < message->data_length) { return RUUVI_DRIVER_ERROR_DATA_SIZE; }
  if(BLE_CONN_HANDLE_INVALID == m_conn_handle) { return RUUVI_DRIVER_ERROR_INVALID_STATE; }

  if(message->repeat)
  {
    return RUUVI_DRIVER_ERROR_NOT_IMPLEMENTED;
  }

  ret_code_t err_code = NRF_SUCCESS;
  uint16_t data_len = message->data_length;
  err_code |= ble_nus_data_send(&m_nus, message->data, &data_len, m_conn_handle);
  return ruuvi_platform_to_ruuvi_error(&err_code);
}

/**
 *
 */
static ruuvi_driver_status_t ruuvi_interface_communication_ble4_gatt_nus_read(ruuvi_interface_communication_message_t* const message)
{
  return RUUVI_DRIVER_ERROR_NOT_SUPPORTED;
}

ruuvi_driver_status_t ruuvi_interface_communication_ble4_gatt_nus_init(ruuvi_interface_communication_t* const _channel)
{
  if(NULL == _channel) { return RUUVI_DRIVER_ERROR_NULL; }
  uint32_t           err_code;
  ble_nus_init_t     nus_init;

  // Initialize NUS.
  memset(&nus_init, 0, sizeof(nus_init));
  nus_init.data_handler = nus_data_handler;
  err_code = ble_nus_init(&m_nus, &nus_init);
  channel = _channel;
  channel->init   = ruuvi_interface_communication_ble4_gatt_nus_init;
  channel->uninit = ruuvi_interface_communication_ble4_gatt_nus_uninit;
  channel->send   = ruuvi_interface_communication_ble4_gatt_nus_send;
  channel->read   = ruuvi_interface_communication_ble4_gatt_nus_read;

  m_gatt_is_init = true;
  return ruuvi_platform_to_ruuvi_error(&err_code);
}

bool ble4_nus_is_connected(void)
{
  ret_code_t err_code = NRF_SUCCESS;
  ble_nus_client_context_t * p_client;

  err_code = blcm_link_ctx_get(m_nus.p_link_ctx_storage, m_conn_handle, (void *) &p_client);
  if (NRF_SUCCESS != err_code)
  {
    return false;
  }

  if ((m_conn_handle == BLE_CONN_HANDLE_INVALID) || (p_client == NULL))
  {
    return false;
  }

  if (!p_client->is_notification_enabled)
  {
    return false;
  }
  return true;
}

ruuvi_driver_status_t ruuvi_interface_communication_ble4_gatt_dfu_init(void)
{

  ret_code_t err_code = NRF_SUCCESS;

    ble_dfu_buttonless_init_t dfus_init = {0};

    // Initialize the async SVCI interface to bootloader.
    err_code = ble_dfu_buttonless_async_svci_init();
    if(NRF_SUCCESS != err_code) {}

    dfus_init.evt_handler = ble_dfu_evt_handler;

    err_code = ble_dfu_buttonless_init(&dfus_init);
    if(NRF_SUCCESS != err_code) {}

  return ruuvi_platform_to_ruuvi_error(&err_code);
}

/**
 * Initialize BLE4 Device firmware update service.
 */
ruuvi_driver_status_t ruuvi_interface_communication_ble4_gatt_dfu_init();

/**
 * Initialize BLE4 Device Information service
 *
 * parameter dis: pointer to data which should be presented over DIS. Memory will be deep-copied
 */
ruuvi_driver_status_t ruuvi_interface_communication_ble4_gatt_dis_init(const ruuvi_interface_communication_ble4_gatt_dis_init_t* const dis)
{
  if(NULL == dis) { return RUUVI_DRIVER_ERROR_NULL; }
  ret_code_t err_code = NRF_SUCCESS;
  ble_dis_init_t dis_init;
  memset(&dis_init, 0, sizeof(dis_init));
  ruuvi_interface_communication_ble4_gatt_dis_init_t dis_local;
  memcpy(&dis_local, dis, sizeof(dis_local));
  ble_srv_ascii_to_utf8(&dis_init.manufact_name_str, dis_local.manufacturer);
  ble_srv_ascii_to_utf8(&dis_init.model_num_str, dis_local.model);
  ble_srv_ascii_to_utf8(&dis_init.serial_num_str, dis_local.deviceid);
  ble_srv_ascii_to_utf8(&dis_init.hw_rev_str, dis_local.hw_version);
  ble_srv_ascii_to_utf8(&dis_init.fw_rev_str, dis_local.fw_version);

  // Read security level 1, mode 1. OPEN, i.e. anyone can read without encryption.
  // Write not allowed.
  dis_init.dis_char_rd_sec = SEC_OPEN;
  err_code = ble_dis_init(&dis_init);
  return ruuvi_platform_to_ruuvi_error(&err_code);
}

/**
 * Start or stop advertising GATT connection.
 *
 * parameter connectable: True to start advertising connectablity false to stop advertising connectablity
 * parameter name: Name of the device to be advertised.
 * parameter company_id: Id of the manufacturer of device
 * parameter advertise_nus: True to enable advertising UUID of NUS in the scan response.
 *
 */
ruuvi_driver_status_t ruuvi_interface_communication_ble4_gatt_advertise_connectablity(const bool connectable, const char* const name, const uint16_t company_id, const bool advertise_nus)
{
  ret_code_t err_code = NRF_SUCCESS;
  if(!connectable)
  {
    err_code |= sd_ble_gap_adv_stop(m_adv_handle);
    return ruuvi_platform_to_ruuvi_error(&err_code);
  }

// Initialize advertising parameters (used when starting advertising).
  memset(&m_adv_params, 0, sizeof(m_adv_params));
  m_adv_params.filter_policy   = BLE_GAP_ADV_FP_ANY;
  m_adv_params.duration        = 0;       // Never time out.
  m_adv_params.properties.type = BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED;
  m_adv_params.p_peer_addr     = NULL;    // Undirected advertisement.
  m_adv_params.interval        = MSEC_TO_UNITS(APPLICATION_CONNECTION_ADVERTISEMENT_INTERVAL, UNIT_0_625_MS);

