ruuvi/ruuvi.drivers.c/nrf5_sdk15_platform/communication/ruuvi_platform_communication_ble4_gatt.c
  // OPEN security for name
  ble_gap_conn_sec_mode_t security;
  uint8_t len = strlen(name);
  security.sm = 1;
  security.lv = 1;
  err_code |= sd_ble_gap_device_name_set(&security, (uint8_t*)name, len);

  memset(&m_adv_data, 0, sizeof(m_adv_data));
  memset(&m_advertisement, 0, sizeof(m_advertisement));
  memset(&m_scanresp, 0, sizeof(m_scanresp));
  ble_advdata_t advdata = {0};
  // Only valid flag
  advdata.flags     = BLE_GAP_ADV_FLAG_BR_EDR_NOT_SUPPORTED;
  // Name will be read from the above GAP data
  advdata.name_type = BLE_ADVDATA_FULL_NAME;
  ble_advdata_manuf_data_t manufacturer_data;
  manufacturer_data.company_identifier = company_id;
  manufacturer_data.data.size = 0;
  manufacturer_data.data.p_data = NULL;

  advdata.p_manuf_specific_data = &manufacturer_data;
  // Encode data
  m_adv_data.adv_data.len = sizeof(m_advertisement);
  err_code |= ble_advdata_encode(&advdata, m_advertisement, &m_adv_data.adv_data.len);
  m_adv_data.adv_data.p_data = m_advertisement;

  // Add scan response if requested
  if(advertise_nus)
  {
    ble_advdata_t scanrsp = {0};
    scanrsp.uuids_complete.uuid_cnt = 1;
    scanrsp.uuids_complete.p_uuids = &(m_adv_uuids[0]);
    // Encode data
    m_adv_data.scan_rsp_data.len = sizeof(m_scanresp);
    err_code |= ble_advdata_encode(&scanrsp, m_scanresp, &m_adv_data.scan_rsp_data.len);
    m_adv_data.scan_rsp_data.p_data = m_scanresp;
  }

  // Configure advertisement and start
  err_code |= sd_ble_gap_adv_set_configure(&m_adv_handle, &m_adv_data, &m_adv_params);
  err_code |= sd_ble_gap_adv_start(m_adv_handle, NRF5_SDK15_BLE4_STACK_CONN_TAG);

  return ruuvi_platform_to_ruuvi_error(&err_code);
}

#endif